#### Terraform Format and Style 🖌`failure`

#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>



```


Success! The configuration is valid.



```



</details>



#### Terraform Plan 📖`success`



<details><summary>Show Plan</summary>



```


terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.Public-1a will be created
  + resource "aws_subnet" "Public-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-1a"
        }
      + tags_all                                       = {
          + "BU"              = "local-market"
          + "BusinessService" = "vfuk-aws-cybersecurity-test"
          + "Confidentiality" = "C2"
          + "Department"      = "Cyber"
          + "Domain"          = "Cyber"
          + "Environment"     = "SANDBOX"
          + "LMEntity"        = "vfuk"
          + "ManagedBy"       = "richard.vanstone@vodafone.com"
          + "Name"            = "Public-1a"
          + "PONumber"        = "po1234567890"
          + "Project"         = "Terraform-POC"
          + "SecurityZone"    = "I-A"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.Public-1b will be created
  + resource "aws_subnet" "Public-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-1b"
        }
      + tags_all                                       = {
          + "BU"              = "local-market"
          + "BusinessService" = "vfuk-aws-cybersecurity-test"
          + "Confidentiality" = "C2"
          + "Department"      = "Cyber"
          + "Domain"          = "Cyber"
          + "Environment"     = "SANDBOX"
          + "LMEntity"        = "vfuk"
          + "ManagedBy"       = "richard.vanstone@vodafone.com"
          + "Name"            = "Public-1b"
          + "PONumber"        = "po1234567890"
          + "Project"         = "Terraform-POC"
          + "SecurityZone"    = "I-A"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.Public-1c will be created
  + resource "aws_subnet" "Public-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public-1c"
        }
      + tags_all                                       = {
          + "BU"              = "local-market"
          + "BusinessService" = "vfuk-aws-cybersecurity-test"
          + "Confidentiality" = "C2"
          + "Department"      = "Cyber"
          + "Domain"          = "Cyber"
          + "Environment"     = "SANDBOX"
          + "LMEntity"        = "vfuk"
          + "ManagedBy"       = "richard.vanstone@vodafone.com"
          + "Name"            = "Public-1c"
          + "PONumber"        = "po1234567890"
          + "Project"         = "Terraform-POC"
          + "SecurityZone"    = "I-A"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.RV-Terra-VPC will be created
  + resource "aws_vpc" "RV-Terra-VPC" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "RV-Terra-VPC"
        }
      + tags_all                             = {
          + "BU"              = "local-market"
          + "BusinessService" = "vfuk-aws-cybersecurity-test"
          + "Confidentiality" = "C2"
          + "Department"      = "Cyber"
          + "Domain"          = "Cyber"
          + "Environment"     = "SANDBOX"
          + "LMEntity"        = "vfuk"
          + "ManagedBy"       = "richard.vanstone@vodafone.com"
          + "Name"            = "RV-Terra-VPC"
          + "PONumber"        = "po1234567890"
          + "Project"         = "Terraform-POC"
          + "SecurityZone"    = "I-A"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```



</details>



*Pushed by: @mischievouscat, Action: `pull_request`*